export const identityContent = {
  title: '你是不是陈紫艳？',
  subtext: 'Only one person should be here.',
  yes: '是 ❤️',
  no: '不是 💔',
  confirmNo: '确定不是吗？',
  confirmYes: '确定',
  reconsider: '我再看看',
  goodbye: '那这封信可能不属于你了 💔',
};

export const passcodeContent = {
  title: '请输入我们的暗码',
  error: '好像不对哦笨蛋~',
  submit: '进入',
};

export const confirmationContent = {
  title: '这里有一封信。',
  subtext: '你真的要打开吗？',
  open: '打开 ❤️',
  later: '以后再看 💔',
  seeHeart: '还是要先看看我的心呢？',
  waiting: '那我会继续等你打开信',
  readNow: '我看~',
};

export const letterContent = {
  header: '200 Days With You ❤️',
  paragraphs: [
    'bae~今天是我们的在一起的200天~又过了一个100天啦~',
    '我把这次的200天看得比520重要是因为我们第一次在一起能超过200天 就是感觉很不容易 感觉真的有在好好磨合 虽然又吵架委屈那些 但是我们能解决好',
    '现在我们也过上了不用异地的生活也是我们想象中的生活',
    '感觉很多情绪都在看到彼此的瞬间 通通都被解决 也能第一时间察觉到对方的情绪',
    '我3月尾才感觉到你越来越依赖我了 我很开心其实 给我感觉我被需要 你很需要很需要我 之前都不是这样的 你遇到什么是都不会跟我讲 现在会了可能我在你身边了吧',
    '但是有时候我真的很对不起你 我可能是太了解你了 变成我很笃定有些东西你就是不会去做 你还没有讲完我就一直给你感觉到我否定你 你肯定会难过的 你会失望吧 对不起 我再改了',
    '你有时候觉得我一直帮你做这个做那个 其实不是的 我是心疼你很累了 帮你分担一点 可是你每次会觉得这是你的东西不应该我做 可是你都很累了我在身边难道就是为了看你累如何心疼你then什么都不做吗',
    '我希望你能依靠我 我在你身边就是为了照顾你 帮你分担 所以我希望你一直需要我 我也希望我能一直被你需要',
    '很多时候我们讲话会有点冲 但是冷静下来会好好解决 而且真的感觉到我们在慢慢磨合 互相理解 包容 不知道就感觉很多东西都在变好了',
    '其实我一件把你规划进未来里 比如以后我想去哪里哪里我都会想到你 我想带你一起去我想去的地方 等我们有时间 很多很多规划里都有你~我们上次去tbs聊了很多',
    '跟你说我不是很在乎很多东西了 人在就好 我觉得很真实的东西 可能是住在一起的关系变到很自然 不用刻意去怎么样 很多没有安全感都可以在见到你的第一面给消化掉',
    '所以我可以跟你讲我不是很在意很多东西了 好像之前我会不给你睡觉什么的吵架 我的本意只是想你陪陪我 可是在你眼里是我不在乎你的感受 你很累',
    '所以bby不是讲你不理解我 我才妥协的 是我心疼你 所以现在我不在乎很多东西是因为比起爱我自己在乎我自己 我更在乎你 更爱你',
    '你叫我好好爱自己 对自己好一点 我真的不能 我再爱你的时候页代表着爱我自己啊 你开心我开心 你难过我心疼 你怎样怎样都会牵动我的情绪 我爱一个人就会全心全意 我觉得爱你就是爱我自己因为我这样做了我开心 我满足 而且我知道你会爱我',
    '讲真的我很担心你 之后没有我在的时候你怎么办 但是有我在我就不希望你去做这些东西 你比我累 我不想你这么累 所以很多东西我愿意来做 你不要担心我会觉得什么什么',
    '你就是另一个我罢了 未来会在一起很久很久的人罢了 所以不用担心我会觉得你什么什么 我不会觉得你不好 你这样当一个小孩子我才更有成就感和安全感 我感觉你需要我了 知道吗',
    '我们会在一起很久 一定会 克服所有东西好不好',
    '你问我我们现在也没有什么可以吵架的 我讲有 但是仔细想了好像真的没有 之前导致吵架的东西都是我没有安全感和想要你陪我导致的 现在我会平衡了 这个问题也不会出现啦',
    '但是bby有时候这种不安全感出现我不知道要怎么面对~我不想打扰你又想你能安抚我 所以你要抱抱我好不好~',
    'bby你最近大声跟我讲话我会委屈可是我不希望你打自己 我很心疼真的 我不希望你这样 你抱抱我就好了 不打自己好不好 虽然我最近给你感觉一直在找事 我真的在好好调整了我不知道为什么会这样 我不想这样 我爱你我很爱你 你也要好好爱我~',
    '我现在只需要你 一直一直需要我 一直一直依赖我 一直一直把我当首选 一直一直把我当成你最重要的人 一直一直能陪着你的人 一直一直不会走的人 一直一直不会不要你的人 一直一直只有我一个人 一直一直能给你安稳的人 一直一直等你的人 一直一直离不开你的人 一直一直馋你的人 一直一直坚定爱你的人 一直一直遇到什么第一个想到你的人 一直一直不会嫌弃你的人 一直一直和你并肩的人 一直一直在你身后的人 一直一直包容你的人 一直一直讲要你娶你的人',
  ],
  closing: [
    '可以这样想我吗',
    '只有你回头我就真的一定在 不可能不在',
    '好不好笨蛋~',
  ],
  readDoneButton: '读完了',
  afterRead: {
    lines: [
      '其实我写到这里的时候，有一点不知道要怎么继续了...不是没有话讲 是突然觉得很幸福很多很多说不完的东西 200天讲长也不长 讲短也不短',
      '但刚好可以让我确定一件事',
      '就是...',
      '我没有想过别人，我只想是你 一直一直是',
      '只要你回头，我一定在',
      '不是一阵子，是一直',
      '200天快乐bby',
      '不管怎么样我的选择只有你 我还是会选你 问多少次 我都只选你',
    ],
    continueButton: '嗯 ❤️',
  },
  finalLine: "I'm still here.",
  endingNextButton: 'Next',
  heartReveal: {
    message: '我真的很爱你 陈紫艳',
    back: '回去',
  },
  heartPulse: {
    backToLetter: '要不要看信？',
  },
};
